package taqwim;

import java.io.BufferedReader;
import java.io.FileReader;
import java.text.SimpleDateFormat;
import java.util.Date;
import javax.swing.JOptionPane;

public class All {

    private final String[] DAY = {
        "Mo", "Tu", "We", "Th", "Fr", "Sa", "Su"};
    private final int[] DAYS = {
        1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15,
        16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31};
    private final int[] MONTH = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};
    private int d2 = 4;
    int j = 0, Hou = 5;
    /*................... التقويم الميلادي الغريغوري..................*/
    private int ds2 = 11, m2 = 1;
    private int Year2 = 1;

    /*................... التقويم الميلادي اليولياني..................*/
    private int ds4 = 13, m4 = 1, a4 = 4;
    private int Year4 = 1;

    /*................... التقويم الهجري الشمسي..................*/
    private int DayShamsi = 21, MonthShamsi = 10, y_Shamsi = 62, yyShamsi = 14;
    private int YearShamsi = -622;
    /*................... التقويم الهجري الشمسي..................*/
    private int ds3 = 298, y3 = 62, yy3 = 14;
    private final int[] DAYS3 = {
        1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366};
    private int Year3 = -623;

    /*................... التقويم الهجري المقوم..................*/
    private int d = 0, ds = 0, m = 12, mm = 30, mmm = 8, ss = 1, sss = 1, aa = 0,
            uu = 0, l = 1, f = 30, i = 29, MM = 1;
    int mon = 29;
    private int Year = -623;

    /*................... التقويم الهجري..................*/
    private int ds5 = 1, m5 = 6;
    private int Year_Qamri = -641;

    public All() throws Exception {
        BufferedReader bufferedReader = new BufferedReader(new FileReader("C:\\Users\\IRHABIYL\\Documents\\Taqwim\\src\\taqwim\\moon.txt"));
        do {
            String message = String.format(
                    "%2s /"
                    + " %5d / %5dHS /"
                    + " %2d / %2d / %5dHS /"
                    + " %2d / %2d / %5dMG /"
                    + " %2d / %2d / %5dMY /"
                    + " %2d / %5dH /"
                    + " %2d / %2d / %5dHM / %5d / %5d / %5d / %5d",
                    DAY[d2],
                    ds3, Year3,
                    DAYS[DayShamsi], MONTH[MonthShamsi], YearShamsi,
                    DAYS[ds2], MONTH[m2], Year2,
                    DAYS[ds4], MONTH[m4], Year4,
                    MONTH[m5], Year_Qamri,
                    DAYS[ds], MONTH[m], Year, sss, uu, ss, l);
            //System.out.println(message);
            if (Year >= -401 && Year <= -300) {
                //System.out.println(DAYS[ds4]+" / "+MONTH[m4]); 
                //System.out.println(Year4);
                //System.out.println(ds3);
                //System.out.println(DAYS[ds]);
                //System.out.println(MONTH[m]);
                //System.out.println(Year);
                //System.out.println(DAY[d2]);
                //System.out.println(MONTH[m5]);
                //System.out.println(Year_Qamri);
            }
            /*................... التقويم الغريغوري..................*/
            if (Hou != 0) {
                d2++;//عداد ايام الأسبوع
                ds2++;//عداد أيام الشهر
                if (d2 == 7) {//إذا بلغ اليوم السابع 
                    d2 = 0;//يتم تصفير العداد ويبدأ من جديد
                }
                /*
                في الشهر الأول والثالث والخامس والسابع والثامن والعاشر والثاني عشر يكون 
                عدد ايام الشهر واحد وثلاثون يوماً
                 */
                if (m2 == 1 || m2 == 3 || m2 == 5 || m2 == 7 || m2 == 8 || m2 == 10 || m2 == 12) {
                    if (ds2 == 31) {
                        ds2 = 0;
                        m2++;//عداد الأشهر
                    }
                    //في الشهر الرابع والسادس والتاسع والحادي عشر يكون عدد ايام الشهر ثلاثون 
                } else if (m2 == 4 || m2 == 6 || m2 == 9 || m2 == 11) {
                    if (ds2 == 30) {
                        ds2 = 0;
                        m2++;//عداد الأشهر
                    }
                }
                if (!(Year2 % 400 == 1 || (Year2 % 4 == 1 && Year2 % 100 != 1))) {
                    if (m2 == 2 && ds2 == 29) {
                        ds2 = 0;
                        m2++;
                    }
                }
                if (!(Year2 % 400 == 0 || (Year2 % 4 == 0 && Year2 % 100 != 0))) {
                    if (m2 == 2 && ds2 == 28) {
                        ds2 = 0;
                        m2++;
                    }
                }
                if (m2 == 13) {
                    m2 = 1;
                    Year2++;
                }
                /*................... التقويم اليولياني..................*/
                ds4++;//عداد أيام الشهر
                /*
                في الشهر الأول والثالث والخامس والسابع والثامن والعاشر والثاني عشر يكون 
                عدد ايام الشهر واحد وثلاثون يوماً
                 */
                if (m4 == 1 || m4 == 3 || m4 == 5 || m4 == 7 || m4 == 8 || m4 == 10 || m4 == 12) {
                    if (ds4 == 31) {
                        ds4 = 0;
                        m4++;//عداد الأشهر
                    }
                    //في الشهر الرابع والسادس والتاسع والحادي عشر يكون عدد ايام الشهر ثلاثون 
                } else if (m4 == 4 || m4 == 6 || m4 == 9 || m4 == 11) {
                    if (ds4 == 30) {
                        ds4 = 0;
                        m4++;//عداد الأشهر
                    }
                }
                if (Year4 % 4 == 0) {
                    if (m4 == 2 && ds4 == 29) {
                        ds4 = 0;
                        m4++;
                    }
                } else {
                    if (m4 == 2 && ds4 == 28) {
                        ds4 = 0;
                        m4++;
                    }
                }
                if (m4 == 13) {
                    m4 = 1;
                    Year4++;
                }
                /*................... التقويم الهجري الشمسي..................*/
                DayShamsi++;
                if (MonthShamsi == 1 || MonthShamsi == 2 || MonthShamsi == 3 || MonthShamsi == 4 || MonthShamsi == 5 || MonthShamsi == 6) {
                    if (DayShamsi == 31) {
                        DayShamsi = 0;
                        MonthShamsi++;
                    }
                } else if (MonthShamsi == 7 || MonthShamsi == 8 || MonthShamsi == 9 || MonthShamsi == 10 || MonthShamsi == 11) {
                    if (DayShamsi == 30) {
                        DayShamsi = 0;
                        MonthShamsi++;
                    }
                }
                if (y_Shamsi == 1 || y_Shamsi == 6 || y_Shamsi == 10 || y_Shamsi == 14 || y_Shamsi == 18 || y_Shamsi == 22
                        || y_Shamsi == 26 || y_Shamsi == 30 || y_Shamsi == 35 || y_Shamsi == 39 || y_Shamsi == 43
                        || y_Shamsi == 47 || y_Shamsi == 51 || y_Shamsi == 55 || y_Shamsi == 59 || y_Shamsi == 63 || y_Shamsi == 68
                        || y_Shamsi == 72 || y_Shamsi == 76 || y_Shamsi == 80 || y_Shamsi == 84 || y_Shamsi == 88 || y_Shamsi == 92
                        || y_Shamsi == 96 || y_Shamsi == 101 || y_Shamsi == 105 || y_Shamsi == 109 || y_Shamsi == 113 || y_Shamsi == 117
                        || y_Shamsi == 121 || y_Shamsi == 125) {
                    if (MonthShamsi == 12 && DayShamsi == 30) {
                        DayShamsi = 0;
                        MonthShamsi++;
                    }
                } else {
                    if (MonthShamsi == 12 && DayShamsi == 29) {
                        DayShamsi = 0;
                        MonthShamsi++;
                    }
                }
                if (MonthShamsi == 13) {
                    MonthShamsi = 1;
                    YearShamsi++;
                    y_Shamsi++;
                    if (YearShamsi == 0) {
                        YearShamsi++;
                    }
                }
                if (y_Shamsi == 129) {
                    y_Shamsi = 1;
                    yyShamsi++;
                }
                if (yyShamsi == 23) {
                    y_Shamsi = 125;
                    yyShamsi++;
                }
                if (yyShamsi == 25) {
                    yyShamsi = 1;
                }
                /*................... التقويم الهجري الشمسي..................*/
                ds3++;
                if (y3 == 1 || y3 == 6 || y3 == 10 || y3 == 14 || y3 == 18 || y3 == 22
                        || y3 == 26 || y3 == 30 || y3 == 35 || y3 == 39 || y3 == 43
                        || y3 == 47 || y3 == 51 || y3 == 55 || y3 == 59 || y3 == 63 || y3 == 68
                        || y3 == 72 || y3 == 76 || y3 == 80 || y3 == 84 || y3 == 88 || y3 == 92
                        || y3 == 96 || y3 == 101 || y3 == 105 || y3 == 109 || y3 == 113 || y3 == 117
                        || y3 == 121 || y3 == 125) {
                    if (ds3 == 367) {
                        ds3 = 1;
                        Year3++;
                        if (Year3 == 0) {
                            Year3++;
                        }
                        y3++;

                        if (y3 == 129) {
                            y3 = 1;
                        }
                    }
                    //System.out.println(message);
                } else {
                    if (ds3 == 366) {
                        if (Year3 >= 1) {
                            //System.out.println(message);
                        }
                        ds3 = 1;
                        Year3++;
                        if (Year3 == 0) {
                            Year3++;
                        }
                        y3++;
                        if (y3 == 129) {
                            y3 = 1;
                            yy3++;
                        }
                        if (yy3 == 23) {
                            y3 = 125;
                            yy3++;
                        }
                        if (yy3 == 25) {
                            yy3 = 1;
                        }
                    }
                }
                //*....................... التقويم الهجري مقوم...........................*/
                d++;//عداد ايام الأسبوع
                if (d == 6) {//إذا بلغ اليوم السادس 
                    d = 0;//يتم تصفير العداد ويبدأ من جديد
                }
                ds++;//عداد أيام الشهر
                l++;
                
                if (ds == f) {
                    if (m==12&&(f == 29||f == 30)) {
                        //System.out.println(ds);
                    }
                    String moon = bufferedReader.readLine();
                    mon = Integer.parseInt(moon);
                    ds = 0;
                    //System.out.println(m);
                    m++;
                    m5++;
                    mmm++;
                    ss++;
                    f = mm;
                    mm = mon;
                    i++;
                    sss++;
                    if (mmm == 33) {
                        aa = m;
                        m = 0;
                    }
                    if (m == 0 && ds == 0 && (ds3 == 186 || ds3 == 187)) {
                        mmm -= 4;
                        m = 9;
                    }
                    if (m == 0 && ds == 0 && (ds3 >= 303 || ds3 <= 309)) {
                        int k = mm;
                        int kk = f;
                        int kkk = k + kk + ds3;
                        if (kkk >= 365 && !(y3 == 1 || y3 == 6 || y3 == 10 || y3 == 14 || y3 == 18 || y3 == 22 || y3 == 26 || y3 == 30 || y3 == 35 || y3 == 39 || y3 == 43 || y3 == 47 || y3 == 51 || y3 == 55 || y3 == 59 || y3 == 63 || y3 == 68 || y3 == 72 || y3 == 76 || y3 == 80 || y3 == 84 || y3 == 88 || y3 == 92 || y3 == 96 || y3 == 101 || y3 == 105 || y3 == 109 || y3 == 113 || y3 == 117 || y3 == 121 || y3 == 125)) {
                            mmm -= 4;
                            m = 13;
                        }
                        if (kkk >= 366 && (y3 == 1 || y3 == 6 || y3 == 10 || y3 == 14 || y3 == 18 || y3 == 22 || y3 == 26 || y3 == 30 || y3 == 35 || y3 == 39 || y3 == 43 || y3 == 47 || y3 == 51 || y3 == 55 || y3 == 59 || y3 == 63 || y3 == 68 || y3 == 72 || y3 == 76 || y3 == 80 || y3 == 84 || y3 == 88 || y3 == 92 || y3 == 96 || y3 == 101 || y3 == 105 || y3 == 109 || y3 == 113 || y3 == 117 || y3 == 121 || y3 == 125)) {
                            mmm -= 4;
                            m = 13;
                        }
                    }
                    if (mmm == 34) {
                        m = aa;
                        mmm = 1;
                        //System.out.println(m);
                        //System.out.println(Year);
                        //System.out.println(i - 2);
                        i = 1;
                    }
                }
                if (m == 13) {
                    m = 1;
                    Year++;
                    uu++;
                    if (Year == 0) {
                        Year++;
                    }
                }
                /*تعيين الشهر الكبيس*/
                if (m == 3 && ds == 1 && (ds3 == 1 || ds3 == 2 || ds3 == 3 || ds3 == 4 || ds3 == 5)) {
                    mmm = 31;
                }
                if (m == 3 && ds == 1 && (ds3 == 6 || ds3 == 7 || ds3 == 8 || ds3 == 9 || ds3 == 10)) {
                    mmm = 27;
                }
                ////////////////////////////////////////////////////////////////
                ////////////////////////////////////////////////////////////////
                ////////////////////////////////////////////////////////////////
                /*..................نهاية التقويم الهجري مقوم...........................*/
                //////////////////////////////////////////////////////////////////////////
                /*....................... التقويم الهجري...........................*/
                if (m5 == 13) {
                    m5 = 1;
                    Year_Qamri++;
                    if (Year_Qamri == 0) {
                        Year_Qamri++;
                    }
                }
                /*...................نهاية التقويم الهجري...........................*/
            }
        } while (j != 203852);
    }

    public static void main(String[] args) throws Exception {
        new All();
    }
}
